MakePayment_Init3DPaymentrq

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:MakePayment_Init3DPayment>
         <!--Optional:-->
         <tem:request>
            <!--Optional:-->
            <trev:AuthenticationHeader>
               <!--Optional:-->
               <trev:SessionId>258041</trev:SessionId>
               <!--Optional:-->
               <trev:SessionToken>a89dca9a-3dc6-4ee3-a3e4-ddfb7e25aa8f</trev:SessionToken>
            </trev:AuthenticationHeader>
            <!--Optional:-->
            <trev:ExtraParamList>
               <!--Zero or more repetitions:-->
            </trev:ExtraParamList>
            <!--Optional:-->
            <trev1:DeductLastSellerCommission>false</trev1:DeductLastSellerCommission>
            <!--Optional:-->
            <trev1:Form>
               <!--Optional:-->
               <trev1:Amount>3405.0</trev1:Amount>
               <!--Optional:-->
               <trev1:BillingName>FATURA</trev1:BillingName>
               <!--Optional:-->
               <!--trev1:BonusInstallmentCount></trev1:BonusInstallmentCount-->
               <!--Optional:-->
               <trev1:CV2>000</trev1:CV2>
               <!--Optional:-->
               <trev1:CardHolder>Ceyda</trev1:CardHolder>
               <!--Optional:-->
               <trev1:CardNumber>4546-7112-3456-7894</trev1:CardNumber>
               <!--Optional:-->
               <trev1:CardType/>
               <!--Optional:-->
               <trev1:Currency>TRY</trev1:Currency>
               <!--Optional:-->
               <trev1:ExpirationMonth>12</trev1:ExpirationMonth>
               <!--Optional:-->
               <trev1:ExpirationYear>26</trev1:ExpirationYear>
               <!--Optional:-->
               <!--trev1:InstallmentCount></trev1:InstallmentCount-->
               <!--Optional:-->
               <!--trev1:InstallmentOptionId></trev1:InstallmentOptionId-->
               <!--Optional:-->
               <!--trev1:Installment_AmountOfInterest></trev1:Installment_AmountOfInterest-->
               <!--Optional:-->
               <!--trev1:Installment_RateOfInterest></trev1:Installment_RateOfInterest-->
               <!--Optional:-->
               <trev1:OriginalAmount>3405.0</trev1:OriginalAmount>
               <!--Optional:-->
               <trev1:ReturnUrl>https://dev-ui.biletbank.local/</trev1:ReturnUrl>
               <!--Optional:-->
               <trev1:ShoppingFileId>9aa8af10-c93b-4c5a-b199-bdaa4126d281</trev1:ShoppingFileId>
            </trev1:Form>
         </tem:request>
      </tem:MakePayment_Init3DPayment>
   </soapenv:Body>
</soapenv:Envelope>